Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this surface.
Remarks:
This unique id can be passed to the Document.GetElement(string) method.
If the originating element belongs to a linked document, the unique id of the link obtained from CADLinkUniqueId should be used to access it.
CADObjectUniqueId is unrelated to the CADObjectId element in gbxml.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Tilt
The tilt angle for this surface, in radians.
Remarks:
The tilt is computed as the angle of rotation between
the outward normal of the surface and the Z-axis.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.Azimuth
The azimuth angle for this surface, in radians.
Remarks:
The azimuth is computed as the angle of rotation between
the outward normal of the surface and the Y-axis (clockwise is positive).
Since:
2012